package methodex;

/*
 * Ststic
 * - 메소드나 멤버 변수에 정의 할 수 있으며 지역변수나 클래스에는 정의 불가
 * - static 키워드에 사용하면 static  변수, static 메소드라고 칭함(static ==>클래스 변수, 클래스 메소드)
 * - 멤버변수나 멤버 메소드는 해당 객체가 생성될때 heap영역에 존재함 
 * - static으로 선언도니 필드, 메소드는 static 영역에 유일하게 만들어 지면서 
 * 	 모든 객체들이 상용할 수 있는 공유의 개념을 가미
 * 
 * - 객체를 생성하지 않아도 사용가능하다.
 * - 접근 방법은 클래스명.변수명  또는 클래스명.메소드명을 접근함
 * 
 * 
 * 메소드 선언방법
 * 접근제한자 static 반환명 메소드명(매개변수)
 * 
 * 멤버필드에 선언
 * 접근제한자 static 자료형 변수명 
 * 
 * 
 * 
 */



public class StaticEx {
	
	
	int x; //전역변수 ,인스턴스 변수 (객체를 만들어야지만 접근이 가능)
	static int y; //클래스 변수, 공유 변수(객체를 생성하지 않아도 접근 가능)
	
	
	
	
	
	
	
	
	
	
	
	
	
	

}
